rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DCM_GPR.h
#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_MASK   (0x400000U)
#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_SHIFT  (22U)
#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_MASK (0x800000U)
#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_SHIFT (23U)
#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_AHBP_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_MASK (0x1000000U)
#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_SHIFT (24U)
#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_AHBM_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_MASK (0x2000000U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_SHIFT (25U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_MASK (0x4000000U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_SHIFT (26U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_MASK (0x8000000U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_SHIFT (27U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_MASK (0x10000000U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_SHIFT (28U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_MASK  (0x20000000U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_SHIFT (29U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_MASK (0x40000000U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_SHIFT (30U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_MASK (0x80000000U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_SHIFT (31U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_MASK)
/*! @} */

/*! @name DCMROD6 - Read-Only GPR On Destructive Reset 6 */
/*! @{ */

#define DCM_GPR_DCMROD6_DMA1_RDATA_EDC_ERR_MASK  (0x1U)
#define DCM_GPR_DCMROD6_DMA1_RDATA_EDC_ERR_SHIFT (0U)
#define DCM_GPR_DCMROD6_DMA1_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD6_DMA1_RDATA_EDC_ERR(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_DMA1_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD6_DMA1_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD6_ZIPWIRE_RDATA_EDC_ERR_MASK (0x2U)
#define DCM_GPR_DCMROD6_ZIPWIRE_RDATA_EDC_ERR_SHIFT (1U)
#define DCM_GPR_DCMROD6_ZIPWIRE_RDATA_EDC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD6_ZIPWIRE_RDATA_EDC_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_ZIPWIRE_RDATA_EDC_ERR_SHIFT)) & DCM_GPR_DCMROD6_ZIPWIRE_RDATA_EDC_ERR_MASK)

#define DCM_GPR_DCMROD6_DMA1_TCD_RAM_ECC_ERR_MASK (0x4U)
#define DCM_GPR_DCMROD6_DMA1_TCD_RAM_ECC_ERR_SHIFT (2U)
#define DCM_GPR_DCMROD6_DMA1_TCD_RAM_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD6_DMA1_TCD_RAM_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_DMA1_TCD_RAM_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD6_DMA1_TCD_RAM_ECC_ERR_MASK)

#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_MASK (0x8U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_SHIFT (3U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC0_NCF_ERR_MASK    (0x10U)
#define DCM_GPR_DCMROD6_SAR_ADC0_NCF_ERR_SHIFT   (4U)
#define DCM_GPR_DCMROD6_SAR_ADC0_NCF_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD6_SAR_ADC0_NCF_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC0_NCF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC0_NCF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC1_NCF_ERR_MASK    (0x20U)
#define DCM_GPR_DCMROD6_SAR_ADC1_NCF_ERR_SHIFT   (5U)
#define DCM_GPR_DCMROD6_SAR_ADC1_NCF_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD6_SAR_ADC1_NCF_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC1_NCF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC1_NCF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC2_NCF_ERR_MASK    (0x40U)
#define DCM_GPR_DCMROD6_SAR_ADC2_NCF_ERR_SHIFT   (6U)
#define DCM_GPR_DCMROD6_SAR_ADC2_NCF_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD6_SAR_ADC2_NCF_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC2_NCF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC2_NCF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC3_NCF_ERR_MASK    (0x80U)
#define DCM_GPR_DCMROD6_SAR_ADC3_NCF_ERR_SHIFT   (7U)
#define DCM_GPR_DCMROD6_SAR_ADC3_NCF_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD6_SAR_ADC3_NCF_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC3_NCF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC3_NCF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC4_NCF_ERR_MASK    (0x100U)
#define DCM_GPR_DCMROD6_SAR_ADC4_NCF_ERR_SHIFT   (8U)
#define DCM_GPR_DCMROD6_SAR_ADC4_NCF_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD6_SAR_ADC4_NCF_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC4_NCF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC4_NCF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC5_NCF_ERR_MASK    (0x200U)
#define DCM_GPR_DCMROD6_SAR_ADC5_NCF_ERR_SHIFT   (9U)
#define DCM_GPR_DCMROD6_SAR_ADC5_NCF_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD6_SAR_ADC5_NCF_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC5_NCF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC5_NCF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC6_NCF_ERR_MASK    (0x400U)
#define DCM_GPR_DCMROD6_SAR_ADC6_NCF_ERR_SHIFT   (10U)
#define DCM_GPR_DCMROD6_SAR_ADC6_NCF_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD6_SAR_ADC6_NCF_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC6_NCF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC6_NCF_ERR_MASK)

