rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DCM_GPR.h
#define DCM_GPR_DCMRWD6_LPSPI4_DBG_DIS_CM7_0_MASK (0x80000U)
#define DCM_GPR_DCMRWD6_LPSPI4_DBG_DIS_CM7_0_SHIFT (19U)
#define DCM_GPR_DCMRWD6_LPSPI4_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_LPSPI4_DBG_DIS_CM7_0(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_LPSPI4_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_LPSPI4_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_LPSPI5_DBG_DIS_CM7_0_MASK (0x100000U)
#define DCM_GPR_DCMRWD6_LPSPI5_DBG_DIS_CM7_0_SHIFT (20U)
#define DCM_GPR_DCMRWD6_LPSPI5_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_LPSPI5_DBG_DIS_CM7_0(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_LPSPI5_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_LPSPI5_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_LPI2C0_DBG_DIS_CM7_0_MASK (0x200000U)
#define DCM_GPR_DCMRWD6_LPI2C0_DBG_DIS_CM7_0_SHIFT (21U)
#define DCM_GPR_DCMRWD6_LPI2C0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_LPI2C0_DBG_DIS_CM7_0(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_LPI2C0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_LPI2C0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_LPI2C1_DBG_DIS_CM7_0_MASK (0x400000U)
#define DCM_GPR_DCMRWD6_LPI2C1_DBG_DIS_CM7_0_SHIFT (22U)
#define DCM_GPR_DCMRWD6_LPI2C1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_LPI2C1_DBG_DIS_CM7_0(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_LPI2C1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_LPI2C1_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXIO_DBG_DIS_CM7_0_MASK (0x800000U)
#define DCM_GPR_DCMRWD6_FLEXIO_DBG_DIS_CM7_0_SHIFT (23U)
#define DCM_GPR_DCMRWD6_FLEXIO_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXIO_DBG_DIS_CM7_0(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXIO_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXIO_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_MASK (0x1000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_SHIFT (24U)
#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_MASK (0x2000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_SHIFT (25U)
#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_MASK (0x4000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_SHIFT (26U)
#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_MASK (0x8000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_SHIFT (27U)
#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN4_DBG_DIS_CM7_0_MASK (0x10000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN4_DBG_DIS_CM7_0_SHIFT (28U)
#define DCM_GPR_DCMRWD6_FLEXCAN4_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN4_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN4_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN4_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN5_DBG_DIS_CM7_0_MASK (0x20000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN5_DBG_DIS_CM7_0_SHIFT (29U)
#define DCM_GPR_DCMRWD6_FLEXCAN5_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN5_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN5_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN5_DBG_DIS_CM7_0_MASK)
/*! @} */

/*! @name DCMRWD7 - Read Write GPR On Destructive Reset 7 */
/*! @{ */

#define DCM_GPR_DCMRWD7_STM2_DBG_DIS_CM7_0_MASK  (0x8U)
#define DCM_GPR_DCMRWD7_STM2_DBG_DIS_CM7_0_SHIFT (3U)
#define DCM_GPR_DCMRWD7_STM2_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_STM2_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_STM2_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_STM2_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_SWT2_DBG_DIS_CM7_0_MASK  (0x10U)
#define DCM_GPR_DCMRWD7_SWT2_DBG_DIS_CM7_0_SHIFT (4U)
#define DCM_GPR_DCMRWD7_SWT2_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_SWT2_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_SWT2_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_SWT2_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_DIGRF_DBG_DIS_CM7_0_MASK (0x40U)
#define DCM_GPR_DCMRWD7_DIGRF_DBG_DIS_CM7_0_SHIFT (6U)
#define DCM_GPR_DCMRWD7_DIGRF_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_DIGRF_DBG_DIS_CM7_0(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_DIGRF_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_DIGRF_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_DSPI_DBG_DIS_CM7_0_MASK  (0x80U)
#define DCM_GPR_DCMRWD7_DSPI_DBG_DIS_CM7_0_SHIFT (7U)
#define DCM_GPR_DCMRWD7_DSPI_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_DSPI_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_DSPI_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_DSPI_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_eFlexPWM0_DBG_DIS_CM7_0_MASK (0x100U)
#define DCM_GPR_DCMRWD7_eFlexPWM0_DBG_DIS_CM7_0_SHIFT (8U)
#define DCM_GPR_DCMRWD7_eFlexPWM0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_eFlexPWM0_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_eFlexPWM0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_eFlexPWM0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_eFlexPWM1_DBG_DIS_CM7_0_MASK (0x200U)
#define DCM_GPR_DCMRWD7_eFlexPWM1_DBG_DIS_CM7_0_SHIFT (9U)
#define DCM_GPR_DCMRWD7_eFlexPWM1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_eFlexPWM1_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_eFlexPWM1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_eFlexPWM1_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_SIPI_DBG_DIS_CM7_0_MASK  (0x400U)
#define DCM_GPR_DCMRWD7_SIPI_DBG_DIS_CM7_0_SHIFT (10U)
#define DCM_GPR_DCMRWD7_SIPI_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_SIPI_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_SIPI_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_SIPI_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_IGF0_DBG_DIS_CM7_0_MASK  (0x1000U)
#define DCM_GPR_DCMRWD7_IGF0_DBG_DIS_CM7_0_SHIFT (12U)
#define DCM_GPR_DCMRWD7_IGF0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_IGF0_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_IGF0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_IGF0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_EDMA1_DBG_DIS_CM7_0_MASK (0x4000U)
#define DCM_GPR_DCMRWD7_EDMA1_DBG_DIS_CM7_0_SHIFT (14U)
#define DCM_GPR_DCMRWD7_EDMA1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_EDMA1_DBG_DIS_CM7_0(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_EDMA1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_EDMA1_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_SD_ADC0_DBG_DIS_CM7_0_MASK (0x20000U)
#define DCM_GPR_DCMRWD7_SD_ADC0_DBG_DIS_CM7_0_SHIFT (17U)
#define DCM_GPR_DCMRWD7_SD_ADC0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_SD_ADC0_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_SD_ADC0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_SD_ADC0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_SD_ADC1_DBG_DIS_CM7_0_MASK (0x40000U)
#define DCM_GPR_DCMRWD7_SD_ADC1_DBG_DIS_CM7_0_SHIFT (18U)
#define DCM_GPR_DCMRWD7_SD_ADC1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_SD_ADC1_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_SD_ADC1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_SD_ADC1_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_SD_ADC2_DBG_DIS_CM7_0_MASK (0x80000U)
#define DCM_GPR_DCMRWD7_SD_ADC2_DBG_DIS_CM7_0_SHIFT (19U)
#define DCM_GPR_DCMRWD7_SD_ADC2_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_SD_ADC2_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_SD_ADC2_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_SD_ADC2_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD7_SD_ADC3_DBG_DIS_CM7_0_MASK (0x100000U)
#define DCM_GPR_DCMRWD7_SD_ADC3_DBG_DIS_CM7_0_SHIFT (20U)
#define DCM_GPR_DCMRWD7_SD_ADC3_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD7_SD_ADC3_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD7_SD_ADC3_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD7_SD_ADC3_DBG_DIS_CM7_0_MASK)
/*! @} */

