rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DCM_GPR.h
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_MASK (0x2000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_SHIFT (25U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_MASK (0x4000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_SHIFT (26U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_MASK (0x8000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_SHIFT (27U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_MASK (0x10000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_SHIFT (28U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_MASK (0x20000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_SHIFT (29U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_MASK)
/*! @} */

/*! @name DCMRWD13 - Read Write GPR On Destructive Reset 13 */
/*! @{ */

#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_MASK (0x8U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_SHIFT (3U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_MASK (0x10U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_SHIFT (4U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_MASK (0x40U)
#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_SHIFT (6U)
#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_MASK (0x80U)
#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_SHIFT (7U)
#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_MASK (0x100U)
#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_SHIFT (8U)
#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_MASK (0x200U)
#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_SHIFT (9U)
#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_MASK (0x400U)
#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_SHIFT (10U)
#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_MASK (0x1000U)
#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_SHIFT (12U)
#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_MASK (0x4000U)
#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_SHIFT (14U)
#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SD_ADC0_DBG_DIS_CM7_2_MASK (0x20000U)
#define DCM_GPR_DCMRWD13_SD_ADC0_DBG_DIS_CM7_2_SHIFT (17U)
#define DCM_GPR_DCMRWD13_SD_ADC0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SD_ADC0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SD_ADC0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SD_ADC0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SD_ADC1_DBG_DIS_CM7_2_MASK (0x40000U)
#define DCM_GPR_DCMRWD13_SD_ADC1_DBG_DIS_CM7_2_SHIFT (18U)
#define DCM_GPR_DCMRWD13_SD_ADC1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SD_ADC1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SD_ADC1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SD_ADC1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SD_ADC2_DBG_DIS_CM7_2_MASK (0x80000U)
#define DCM_GPR_DCMRWD13_SD_ADC2_DBG_DIS_CM7_2_SHIFT (19U)
#define DCM_GPR_DCMRWD13_SD_ADC2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SD_ADC2_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SD_ADC2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SD_ADC2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SD_ADC3_DBG_DIS_CM7_2_MASK (0x100000U)
#define DCM_GPR_DCMRWD13_SD_ADC3_DBG_DIS_CM7_2_SHIFT (20U)
#define DCM_GPR_DCMRWD13_SD_ADC3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SD_ADC3_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SD_ADC3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SD_ADC3_DBG_DIS_CM7_2_MASK)
/*! @} */

/*! @name DCMRWD14 - Read Write GPR On Destructive Reset 14 */
/*! @{ */

#define DCM_GPR_DCMRWD14_DMA1_RDATA_EDC_ERR_EN_MASK (0x1U)
#define DCM_GPR_DCMRWD14_DMA1_RDATA_EDC_ERR_EN_SHIFT (0U)
#define DCM_GPR_DCMRWD14_DMA1_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_DMA1_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_DMA1_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_DMA1_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_ZIPWIRE_RDATA_EDC_ERR_EN_MASK (0x2U)
#define DCM_GPR_DCMRWD14_ZIPWIRE_RDATA_EDC_ERR_EN_SHIFT (1U)
#define DCM_GPR_DCMRWD14_ZIPWIRE_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_ZIPWIRE_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_ZIPWIRE_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_ZIPWIRE_RDATA_EDC_ERR_EN_MASK)

