rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DCM_GPR.h
#define DCM_GPR_DCMRWD14_DMA1_TCD_RAM_ECC_ERR_EN_MASK (0x4U)
#define DCM_GPR_DCMRWD14_DMA1_TCD_RAM_ECC_ERR_EN_SHIFT (2U)
#define DCM_GPR_DCMRWD14_DMA1_TCD_RAM_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_DMA1_TCD_RAM_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_DMA1_TCD_RAM_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_DMA1_TCD_RAM_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_MASK (0x8U)
#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_SHIFT (3U)
#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_QSPI_FLASHA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC0_NCF_ERR_EN_MASK (0x10U)
#define DCM_GPR_DCMRWD14_SAR_ADC0_NCF_ERR_EN_SHIFT (4U)
#define DCM_GPR_DCMRWD14_SAR_ADC0_NCF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC0_NCF_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC0_NCF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC0_NCF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC1_NCF_ERR_EN_MASK (0x20U)
#define DCM_GPR_DCMRWD14_SAR_ADC1_NCF_ERR_EN_SHIFT (5U)
#define DCM_GPR_DCMRWD14_SAR_ADC1_NCF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC1_NCF_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC1_NCF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC1_NCF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC2_NCF_ERR_EN_MASK (0x40U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_NCF_ERR_EN_SHIFT (6U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_NCF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_NCF_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC2_NCF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC2_NCF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC3_NCF_ERR_EN_MASK (0x80U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_NCF_ERR_EN_SHIFT (7U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_NCF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_NCF_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC3_NCF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC3_NCF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC4_NCF_ERR_EN_MASK (0x100U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_NCF_ERR_EN_SHIFT (8U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_NCF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_NCF_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC4_NCF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC4_NCF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC5_NCF_ERR_EN_MASK (0x200U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_NCF_ERR_EN_SHIFT (9U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_NCF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_NCF_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC5_NCF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC5_NCF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC6_NCF_ERR_EN_MASK (0x400U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_NCF_ERR_EN_SHIFT (10U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_NCF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_NCF_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC6_NCF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC6_NCF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC0_CF_ERR_EN_MASK (0x800U)
#define DCM_GPR_DCMRWD14_SAR_ADC0_CF_ERR_EN_SHIFT (11U)
#define DCM_GPR_DCMRWD14_SAR_ADC0_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC0_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC0_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC0_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC1_CF_ERR_EN_MASK (0x1000U)
#define DCM_GPR_DCMRWD14_SAR_ADC1_CF_ERR_EN_SHIFT (12U)
#define DCM_GPR_DCMRWD14_SAR_ADC1_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC1_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC1_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC1_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_MASK (0x2000U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_SHIFT (13U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_MASK (0x4000U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_SHIFT (14U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_MASK (0x8000U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_SHIFT (15U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_MASK (0x10000U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_SHIFT (16U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_MASK (0x20000U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_SHIFT (17U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_MASK     (0x80000U)
#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_SHIFT    (19U)
#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_WIDTH    (1U)
#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_MASK     (0x100000U)
#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_SHIFT    (20U)
#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_WIDTH    (1U)
#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_MASK     (0x200000U)
#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_SHIFT    (21U)
#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_WIDTH    (1U)
#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_MASK)

